/*
1，如何应对阿里巴巴全球业务形态的高速增长与变化，让我们的产品在不限于电商、金融、云、文娱、新零售等各种场景下都能保障业务平稳运行
2，如何通过产品驱动上百个技术团队、数万名研发人员共同高效协作，完成稳定性业务目标
3，如何发现、汇集、加工海量的运维数据，并实时流转到需要的人员手中，让他们有能力在第一时间预防、发现、解决各种复杂场景下的业务问题

职位要求：

1.熟悉 W3C 标准、精通 Web 技术, 包括Javascript、HTML/HTML5、CSS/CSS3等；

2.熟悉 HTTP 协议以及缓存技术，了解基本的浏览器渲染原理以及网络传输过程；

3.熟悉 Angular、Vue、React 类框架。有ant.design的开发经验者尤佳；

4.熟悉前端自动化构建工具，熟悉 Grunt、Gulp、Webpack、FIS；

5.对前端模块化开发有一定了解（如AMD,CommondJS等)，并有实践经验；

6.对Web性能优化有深入了解;

7.持续关注业界的新话题和新技术，了解ES6, 了解Promise协议;


前端工程化
页面多语言，用一个字典
react-redux connect原理
promise原理
redux架构数据流

如何保证代码不出现错误，尽可能减少线上问题
线上问题处理

前端安全问题
cookie敏感信息加密?

